# 1) მომხმარებელი შემოიტანს რიცხვს. გადავაქცევთ მას int ტიპად და გამოვიტანთ.
number = int(input("შეიყვანე რიცხვი: "))
print("შენი რიცხვია როგორც ინტეჯერი:", number)

# 2) მომხმარებელი შემოიტანს რაიმე ინფორმაციას და დავბეჭდავთ მის მონაცემთა ტიპს
info = input("შეიყვანე რაიმე ინფორმაცია: ")
print("შენი შემოტანილი მონაცემის ტიპია:", type(info))

# 3) ცვლადში ვინახავთ სტრინგს '15' და ვაქცევთ მას ინტეჯერად
str_number = '15'
int_number = int(str_number)
print("სტრინგიდან გარდაქმნილი რიცხვია:", int_number)

# 4) type() ფუნქცია აბრუნებს ობიექტის მონაცემთა ტიპს
# მაგ: type("hello") დააბრუნებს <class 'str'>, რადგან ეს სტრინგია

# 5) input() ფუნქცია მომხმარებელს სთხოვს, შეიტანოს მონაცემი კლავიატურიდან
# მაგალითად: input("შეიყვანე შენი სახელი") დაელოდება შეყვანას და დააბრუნებს სტრინგად